/*
给定一个长度为 N 的数列，如果其中一段连续的子序列 (i≤j) 之和是 K 的倍数，我们就称这个区间 [i,j] 是K 倍区间。你能求出数列中总共有多少个 K 倍区间吗？
*/
#include<stdio.h>
int main() {
	int i, n, k, j;
	int arr[1000];
	scanf("%d", & n);
	for (i = 0; i < n; i++) {
		scanf("%d", & arr[i]);
	}
	for (i = 0; i < n; i++) {
		for (int j = i; j < i; j++) {
			for (int k = i; k <= i; k++) {
				printf("%d", arr[k]);
			}
		}
	}



	return 0;
}


/*
问题一：如何输出一个子数组？
		这个问题比较空范，不如细化一下，例如一个数组{1，2，3，}-----为什么不用{1，2，3，4，5}？因为太长，懒得写
		子数组分别为
		1
		1，2
		1，3
		1，2，3
		2
		2，3
		3
		在这种输出模式中，需要确定下来的东西有：数组从哪开始和子数组中元素的个数，这样就能确定下来子数组在哪里结束
		从哪开始简单，元素的个数怎么解决呢？
		其实在之前的练习中，有过计数的题目，那我们只需要在计数的前提下，输出相应个数的元素

		用变量i来确定从哪开始，变量j，k确定元素的个数
*/
