/*
利马克准备参加2016年最后一天的编程比赛。比赛将于20:00开始，持续4小时直至午夜。比赛共有n道题目，按难度排序，其中第1题最简单，第n题最难。利马克知道自己解出第i道题需要5·i分钟。

利马克的朋友们正在筹办跨年派对，他想在午夜前赶到现场。从他参加比赛的家里出发到派对地点需要k分钟。

如果利马克想准时参加派对，他最多能解出多少道题目？

输入
输入只有一行，包含两个整数n和k（1 ≤ n ≤ 10，1 ≤ k ≤ 240）——分别表示比赛题目数量和利马克从家到派对所需时间（分钟）。

输出
输出一个整数，表示利马克在确保能准时参加派对的前提下，最多能解决的题目数量。
*/
#include<stdio.h>
int main() {
	int n, k, i, a, b = 0;
	scanf("%d", &n);
	scanf("%d", &k);
	for (i = 1; b + 5 * i <= 240 - k; i++) {
		a = 5 * i;
		b = b + a;
	}
	if (i > n) {
		i = n ;
	}
	printf("%d", i );
	return 0;
}

/*
Input	Output
3 222    2
Input	Output
4 190    4
Input	Output
7 1      7
*/
/*
第一个错误：时间判断错误--一开始在for循环中，写的是b<240，这样子错在只进行了对本次循环的计算，但这道题目应该是对下次循环的判断；
第二个错误：b+5*i<240-k有一种特殊情况被忽视了，即为第二组数据那样的恰好完成的情况；
*/
