/*
Ojk是一个很帅气的程序员，他准备去找网恋对象奔现。但这并不像听起来那么容易，Ojk现在面临的问题是找到最便宜的方式去对象的城市。

Ojk知道n个机场。所有的机场都位于一条直线上。每个机场都有唯一的编号，从1到n， Ojk的家位于编号为a的机场旁边，对象所在的城市位于编号为b的机场旁边。Ojk的家和对象所在的城市有可能位于同一个机场附近。

为了去找对象，Ojk可以在任意一对机场之间飞行任意次数，但他必须从机场a开始，在机场b结束。

每个机场属于两家公司中的一家。如果两个机场属于同一家公司，则从机场i到机场j的飞行成本为零，如果两个机场属于不同的公司，则为∣i−j∣。

求Ojk找到对象的最低费用。
*/
#include<stdio.h>
int main() {
	int a, b, n, c, d;
	int arr[1000];
	scanf("%d", &n);
	scanf("%d%d", &a, &b);
	printf("\n");
	for (int i = 0; i < n; i++) {
		scanf("%d", & arr[i]);
	}
	c = arr[a - 1];
	d = arr[b - 1];
	if (c == d)printf("0");
	else {
		printf("1");
	}

	return 0;
}


/*
问题一：怎样构建数学模型，怎样才算最短？
		根据题目可知，同一家公司间飞行不收费，若最多改变一次航线，则收费最少
问题二：如何让C语言代码只输入0和1
	探究这个问题对解决这道题目没有意义，原因如下：
	不影响OJ正常输入
	题目没有要求

	但是有助于软件开发

问题三：理解题目错误，误以为航班转公司需要1块钱，但题目里面明确说了是|j-i|
		进一步思考，收费最少的是距离最短的那两个地点
		所以题目现在改变了，要求的应该是如何找到距离最短的0和1，或者是两个0，两个1。
		那什么时候距离最近呢？
		相邻的时候，
		什么时候会相邻呢？
		一定会，因为只有0和1两种情况
*/
