/*
题目描述
int x=5, y=8;
交换p1和p2，不改变x,y本身的值，最后输出*p1、*p2。
*/

#include<stdio.h>
int main() {
	int x = 5, y = 8;//每命名一个int类型变量，就相当于给某个地址一个代号，另外还有一串数字是给内存看的名字
	int *p1,*p2,*temp;//
	p1 = &x;//x中存放的是5这个数，p1存放的是x的地址，p1的内容是x的cpu地址
	p2 = &y;//y中存放的是8这个数，p2存放的是y的地址，p2的内容是y的cpu地址
	printf("%d", *p1);
	temp = p1;//把p1的值赋给temp，p1的值是x的地址
	p1 = p2; //把p2的值赋给p1，p2的值是y的地址
	p2 = temp; //把temp的值赋给p2，temp此时是原p1的值
	printf("%d", x);//要输出x里面的东西
	printf("%d", y);//输出y里面的东西
	return 0;
}

/*


指针深度思考^<>^:
&的本质是找到变量(就是找到他的地址）
地址就是指针，指针变量是一个储存变量地址的值，注意在这里的指针p也是一个变量，拥有自己的地址
*是解引用，要找到这个地址可并访问，访问包括读现有变量，也可写新变量，这两种都会得到地址里面的一个值。
	在等号右边代表读取这个数字。
例如：int b=*p  就代表b的值是p地址内的东西
	在等号左边代表输入一个数字。
例如：*p=&b     就代表往p这个指针内填的数字

如果在前面什么也没有（就是没有*和&的情况），就指这个指针本身。

疑问：这个等号更改的是指针里的地址还是指针里的数据？——————扩展：在指针的章节中，等号有九种：*=*、&=*、*=&、&=&、 = 、 =*、 =&、*= 、&=，分别代表什么
等号相当于赋值（重要！），只能给地址赋值为地址，值赋值一个值，这也是为什么int变量只能赋值给int变量

第一种：  =   型：赋值，就代表右边的给左边赋值，等号两边的值
第二种： *=   型：

*/
